Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 flatten (Flatten)           (None, 5)                 0         
                                                                 
 dense (Dense)               (None, 80)                480       
                                                                 
 dropout (Dropout)           (None, 80)                0         
                                                                 
 dense_1 (Dense)             (None, 60)                4860      
                                                                 
 dropout_1 (Dropout)         (None, 60)                0         
                                                                 
 dense_2 (Dense)             (None, 3)                 183       
                                                                 
=================================================================
Total params: 5523 (21.57 KB)
Trainable params: 5523 (21.57 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
