Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 flatten (Flatten)           (None, 5)                 0         
                                                                 
 dense (Dense)               (None, 26)                156       
                                                                 
 dropout (Dropout)           (None, 26)                0         
                                                                 
 dense_1 (Dense)             (None, 26)                702       
                                                                 
 dropout_1 (Dropout)         (None, 26)                0         
                                                                 
 dense_2 (Dense)             (None, 26)                702       
                                                                 
 dropout_2 (Dropout)         (None, 26)                0         
                                                                 
 dense_3 (Dense)             (None, 26)                702       
                                                                 
 dropout_3 (Dropout)         (None, 26)                0         
                                                                 
 dense_4 (Dense)             (None, 26)                702       
                                                                 
 dropout_4 (Dropout)         (None, 26)                0         
                                                                 
 dense_5 (Dense)             (None, 26)                702       
                                                                 
 dropout_5 (Dropout)         (None, 26)                0         
                                                                 
 dense_6 (Dense)             (None, 26)                702       
                                                                 
 dropout_6 (Dropout)         (None, 26)                0         
                                                                 
 dense_7 (Dense)             (None, 26)                702       
                                                                 
 dropout_7 (Dropout)         (None, 26)                0         
                                                                 
 dense_8 (Dense)             (None, 26)                702       
                                                                 
 dropout_8 (Dropout)         (None, 26)                0         
                                                                 
 dense_9 (Dense)             (None, 26)                702       
                                                                 
 dropout_9 (Dropout)         (None, 26)                0         
                                                                 
 dense_10 (Dense)            (None, 26)                702       
                                                                 
 dropout_10 (Dropout)        (None, 26)                0         
                                                                 
 dense_11 (Dense)            (None, 3)                 81        
                                                                 
=================================================================
Total params: 7257 (28.35 KB)
Trainable params: 7257 (28.35 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
