Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 flatten (Flatten)           (None, 5)                 0         
                                                                 
 dense (Dense)               (None, 512)               3072      
                                                                 
 dropout (Dropout)           (None, 512)               0         
                                                                 
 dense_1 (Dense)             (None, 1024)              525312    
                                                                 
 dropout_1 (Dropout)         (None, 1024)              0         
                                                                 
 dense_2 (Dense)             (None, 3)                 3075      
                                                                 
=================================================================
Total params: 531459 (2.03 MB)
Trainable params: 531459 (2.03 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
