Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 flatten (Flatten)           (None, 5)                 0         
                                                                 
 dense (Dense)               (None, 128)               768       
                                                                 
 dropout (Dropout)           (None, 128)               0         
                                                                 
 dense_1 (Dense)             (None, 96)                12384     
                                                                 
 dropout_1 (Dropout)         (None, 96)                0         
                                                                 
 dense_2 (Dense)             (None, 3)                 291       
                                                                 
=================================================================
Total params: 13443 (52.51 KB)
Trainable params: 13443 (52.51 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
